In [2]:
import numpy as np
import pandas as pd

In [6]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [11]:
df['col2'].nunique()

3

In [1]:
pwd

'C:\\Users\\ARPIT JAIN\\Desktop\\UDEMY PYTHON\\Python-Data-Science-and-Machine-Learning-Bootcamp\\Python-for-Data-Analysis\\Pandas'

In [4]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [4]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

c:\users\arpit jain\appdata\local\programs\python\python36\lib\site-packages\pandas\util\_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df=pd.read_csv('example')

In [6]:
from sqlalchemy import create_engine

In [7]:
engine= create_engine('sqlite:///:memory:')

In [11]:
df.to_sql('my_table',engine)

In [12]:
sqldf= pd.read_sql('my_table',con= engine)

In [13]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15